Revit 2027 API
UnitTypeId.StationingSurveyFeet Property
 US survey feet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StationingSurveyFeet { get; }
Public Shared ReadOnly Property StationingSurveyFeet As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StationingSurveyFeet {
	ForgeTypeId^ get ();
}
static member StationingSurveyFeet : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace